<a href="https://colab.research.google.com/github/destiny-park/DataAnalysis/blob/main/BigdataPrep_%EC%9E%91%EC%97%851.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
dataUrl = r'/content/drive/MyDrive/Data Analysis_Practice_Codes/2022/BigData_exam/data/basic2.csv'

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv(dataUrl)
df.info()

2022년 5월 sales의 중앙값을 구하시오
데이터셋 : basic2.csv
오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작

In [ ]:
df.head(8)

In [ ]:
# datetime으로 type변경
# 이 방법은 datetime이라는 pandas의 기능을 활용 
df['Date'] = pd.to_datetime(df['Date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    730 non-null    datetime64[ns]
 1   Sales   730 non-null    int64
 2   PV      730 non-null    int64
 3   UV      684 non-null    float64
 4   Events  730 non-null    int64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 28.6 KB

In [ ]:
# 새로운 컬럼 추가 (년, 월, 일)
df['year'] = df['Date'].dt.year
df['month'] = df['Date'].dt.month
df['day'] = df['Date'].dt.day

In [ ]:
# 문제 조건에 맞는 값 구하기
cond = (df['year']==2022) & (df['month']==5)
print(df[cond]['Sales'].median())

1477685.0

주어진 데이터에서 2022년 5월 주말과 평일의 sales컬럼 평균값 차이를 구하시오 (소수점 둘째자리까지 출력, 반올림)
데이터셋 : basic2.csv
오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작

In [ ]:
cond = (df['year']==2022 & (df['day']))

In [ ]:
# 주말부터 찾아야 함.

In [ ]:
dir(pd.datetime)

In [ ]:
help(pd.datetime.weekday)

In [ ]:
df.head()

        Date     Sales      PV      UV  Events  year  month  day
0 2022-01-01  22711525  397349  4421.0       1  2022      1    1
1 2022-01-02     36779    3969  2289.0       0  2022      1    2
2 2022-01-03  13943875  373890     NaN       1  2022      1    3
3 2022-01-04   8088593  142054  2157.0       0  2022      1    4
4 2022-01-05   2395374  190684     NaN       0  2022      1    5

In [ ]:
df['Date'].values[0:3]

array(['2022-01-01T00:00:00.000000000', '2022-01-02T00:00:00.000000000',
       '2022-01-03T00:00:00.000000000'], dtype='datetime64[ns]')

In [ ]:
df['dayofweek'] = df['Date'].dt.dayofweek # 0이 Monday 0~ 6까지

In [ ]:
df['weekend'] = df['dayofweek'].apply(lambda x: x>=5, 1, 0) # 1이 주말 
# x > 5보다 크면 1, 아니면 0
# apply or map

In [ ]:
df.head()

,Date,Sales,PV,UV,Events,year,month,day,dayofweek,weekend
0,2022-01-01,22711525,397349,4421.0,1,2022,1,1,5,True
1,2022-01-02,36779,3969,2289.0,0,2022,1,2,6,True
2,2022-01-03,13943875,373890,NaN,1,2022,1,3,0,False
3,2022-01-04,8088593,142054,2157.0,0,2022,1,4,1,False
4,2022-01-05,2395374,190684,NaN,0,2022,1,5,2,False

In [ ]:
# 2022년 5월 주말과 평일

weekendCond = ((df['year'] == 2022) & (df['month'] == 5) & (df['weekend'] == 1))
weekdayCond = ((df['year'] == 2022) & (df['month'] == 5) & (df['weekend'] == 0))

In [ ]:
df[weekdayCond]['Sales'].mean()

3683611.4545454546

In [ ]:
df[weekendCond]['Sales'].mean()

6693950.555555556

평균값 차이를 구하시오 (소수점 둘째자리까지 출력, 반올림

In [ ]:
round(df[weekendCond]['Sales'].mean() - df[weekdayCond]['Sales'].mean(),2)

3010339.1

주어진 데이터에서 2022년 월별 Sales 합계 중 가장 큰 금액과
2023년 월별 Sales 합계 중 가장 큰 금액의 차이를 절대값으로 구하시오.
단 Events컬럼이 '1'인경우 80%의 Salse값만 반영함
(최종값은 소수점 반올림 후 정수 출력)

In [ ]:
# 2022년 월별 Sales 합계 중 가장 큰 금액

df.columns

Index(['Date', 'Sales', 'PV', 'UV', 'Events', 'year', 'month', 'day',
       'dayofweek', 'weekend'],
      dtype='object')

In [ ]:
# 단 Events컬럼이 '1'인경우 80%의 Salse값만 반영

In [ ]:
def event_sales(x):
    if x['Events'] == 1:
        x['Sales2'] = x['Sales']*0.8
    else:
        x['Sales2'] = x['Sales']
    return x


df = df.apply(lambda x: event_sales(x), axis=1) #1일 경우 row, 0일 경우 컬럼
df.head()

,Date,Sales,PV,UV,Events,year,month,day,dayofweek,weekend,Sales2
0,2022-01-01,22711525,397349,4421.0,1,2022,1,1,5,True,18169220.0
1,2022-01-02,36779,3969,2289.0,0,2022,1,2,6,True,36779.0
2,2022-01-03,13943875,373890,NaN,1,2022,1,3,0,False,11155100.0
3,2022-01-04,8088593,142054,2157.0,0,2022,1,4,1,False,8088593.0
4,2022-01-05,2395374,190684,NaN,0,2022,1,5,2,False,2395374.0

In [ ]:
y2022df = df[df['year'] == 2022]
y2023df = df[df['year'] == 2023]

In [ ]:
y2022df.head()

,Date,Sales,PV,UV,Events,year,month,day,dayofweek,weekend,Sales2
0,2022-01-01,22711525,397349,4421.0,1,2022,1,1,5,True,18169220.0
1,2022-01-02,36779,3969,2289.0,0,2022,1,2,6,True,36779.0
2,2022-01-03,13943875,373890,NaN,1,2022,1,3,0,False,11155100.0
3,2022-01-04,8088593,142054,2157.0,0,2022,1,4,1,False,8088593.0
4,2022-01-05,2395374,190684,NaN,0,2022,1,5,2,False,2395374.0

In [ ]:
y2022df.tail()

In [ ]:
max(y2022df.groupby(y2022df['month']).sum()['Sales2'])

222485234

In [ ]:
max(y2023df.groupby(y2023df['month']).sum()['Sales2'])

283181917

In [ ]:
# 가장 큰 금액의 차이를 절대값, 최종값은 소수점 반올림 후 정수 출력

In [ ]:
round(abs(max(y2022df.groupby(y2022df['month']).sum()['Sales2']) - max(y2023df.groupby(y2023df['month']).sum()['Sales2'])))

42473436

고객과 잘 맞는 타입 추천 :)
basic1 데이터 중 'f4'를 기준으로 basic3 데이터 'f4'값을 기준으로 병합하고,
병합한 데이터에서 r2결측치를 제거한다음, 앞에서 부터 20개 데이터를 선택하고 'f2'컬럼 합을 구하시오

In [ ]:
dataUrl_1 = r'/content/drive/MyDrive/Data Analysis_Practice_Codes/2022/BigData_exam/data/basic1.csv'
df_basic1 = pd.read_csv(dataUrl_1)
dataUrl_3 = r'/content/drive/MyDrive/Data Analysis_Practice_Codes/2022/BigData_exam/data/basic3.csv'
df_basic3 = pd.read_csv(dataUrl_3)

In [ ]:
df_basic1.head()

In [ ]:
df_basic3.head()

In [ ]:
dir(pd)

In [ ]:
help(pd.merge)

In [ ]:
df3 = df_basic1

In [ ]:
df3 = df3.merge(df_basic3) # leftjoin은 left가 기준 // rightjoin은 right가 기준

In [ ]:
df3

병합한 데이터에서 r2결측치를 제거한다음, 앞에서 부터 20개 데이터를 선택하고 'f2'컬럼 합을 구하시오

In [ ]:
df3['r2'].isnull().sum() # 결측치 갯수

17

In [ ]:
df3['r2'].isnull()

0     False
1     False
2     False
3     False
4     False
      ...
95    False
96    False
97    False
98    False
99    False
Name: r2, Length: 100, dtype: bool

In [ ]:
df4 = df3[df3['r2'].isnull() == 0]

In [ ]:
df4['r2'].isnull().sum()

0

In [ ]:
df4[0:19]['f2'].sum()

15

나이 구간 나누기
basic1 데이터 중 'age'컬럼 이상치를 제거하고, 동일한 개수로 나이 순으로 3그룹으로 나눈 뒤 각 그룹의 중앙값을 더하시오
(이상치는 음수(0포함), 소수점 값)

In [ ]:
df_basic1.columns

Index(['id', 'age', 'city', 'f1', 'f2', 'f3', 'f4', 'f5'], dtype='object')

In [ ]:
df_basic1['age']

0       2.0
1       9.0
2      27.0
3      75.0
4      24.0
      ...
95     92.0
96    100.0
97     39.0
98      1.0
99     47.0
Name: age, Length: 100, dtype: float64

In [ ]:
(df_basic1['age'] <= 0).sum() # 0이거나 0보다 작은 값은 4개

4

In [ ]:
minusCon = (df_basic1['age'] <= 0)

In [ ]:
(df_basic1['age'] - round(df_basic1['age']) != 0).sum() # 8개

8

In [ ]:
floatCon = (df_basic1['age'] - round(df_basic1['age']) != 0)

In [ ]:
df2 = df_basic1[~minusCon & ~floatCon]

In [ ]:
df2.tail()

       id    age city    f1  f2   f3    f4         f5
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

In [ ]:
df2[minusCon].sum()

In [ ]:
df2[floatCon].sum()

동일한 개수로 나이 순으로 3그룹으로 나눈 뒤 각 그룹의 중앙값을 더하시오

In [ ]:
df3 = df2.sort_values('age')

In [ ]:
df3.head()

      id  age city     f1  f2   f3    f4         f5
98  id99  1.0   경기   47.0   0  NaN  ESFJ  97.381034
0   id01  2.0   서울    NaN   0  NaN  ENFJ  91.297791
85  id86  2.0   경기    NaN   0  NaN  ESTP  29.269869
56  id57  3.0   대구  111.0   0  NaN  ISFJ  29.269869
90  id91  6.0   경기   72.0   0  NaN  INTP   9.796378

In [ ]:
df3.shape

(90, 8)

In [ ]:
ydf = df3[0:30]
mdf = df3[30:60]
odf = df3[60:90]

In [ ]:
ydf.shape

(30, 8)

In [ ]:
ydf.head()

In [ ]:
mdf.shape

(30, 8)

In [ ]:
odf.shape

(30, 8)

In [ ]:
ydf['age'].median() + mdf['age'].median() + odf['age'].median()

165.0

주어진 데이터(basic2.csv)에서 주 단위 Sales의 합계를 구하고, 가장 큰 값을 가진 주와 작은 값을 가진 주의 차이를 구하시오(절대값)

In [ ]:
df.columns

Index(['Date', 'Sales', 'PV', 'UV', 'Events', 'year', 'month', 'day',
       'dayofweek', 'weekend', 'Sales2'],
      dtype='object')

In [ ]:
df.head() # 0(월요일) ~ 6 일

,Date,Sales,PV,UV,Events,year,month,day,dayofweek,weekend,Sales2
0,2022-01-01,22711525,397349,4421.0,1,2022,1,1,5,True,18169220.0
1,2022-01-02,36779,3969,2289.0,0,2022,1,2,6,True,36779.0
2,2022-01-03,13943875,373890,NaN,1,2022,1,3,0,False,11155100.0
3,2022-01-04,8088593,142054,2157.0,0,2022,1,4,1,False,8088593.0
4,2022-01-05,2395374,190684,NaN,0,2022,1,5,2,False,2395374.0

In [ ]:
df.groupby(df['month']).sum()['Sales2'])

In [ ]:
dir(pd.dt)

In [ ]:
df['dayofweek'] = df['Date'].dt.dayofweek # 0이 Monday 0~ 6까지

f1의 결측치를 채운 후 age 컬럼의 중복 제거 전과 후의 'f1' 중앙값 차이를 구하시오
- 결측치는 f1의 데이터 중 내림차순 정렬 후 10번째 값으로 채움
- 중복 데이터 발생시 뒤에 나오는 데이터를 삭제함
- 최종 결과값은 절대값으로 출력

 basic1.csv

In [ ]:
df_basic1.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [ ]:
dir(df_basic1.fillna)

In [ ]:
help(df_basic1.fillna)

결측치는 f1의 데이터 중 내림차순 정렬 후 10번째 값으로 채움

In [ ]:
df_basic1.sort_values('f1',ascending=False).iloc[0:10,]

      id   age city     f1  f2   f3    f4         f5
56  id57   3.0   대구  111.0   0  NaN  ISFJ  29.269869
7   id08  38.0   서울  101.0   1  NaN  INFJ  83.685380
57  id58   0.0   대구  100.0   2  NaN  ESTP  33.308999
73  id74  45.0   경기   98.0   0  NaN  ESTP  52.667078
71  id72   8.0   경기   97.0   0  NaN  ESTJ  97.381034
69  id70  -9.0   경기   96.0   1  NaN  ISTP  48.431184
77  id78  92.0   경기   96.0   1  NaN  INTJ  69.730313
32  id33  47.0   부산   94.0   0  NaN  ENFJ  17.252986
48  id49  75.0   대구   88.0   0  NaN  INTP  37.113739
44  id45  97.0   대구   88.0   0  NaN  ENFJ  13.049921

In [ ]:
df_basic1.sort_values('f1')[0:10]

      id   age city    f1  f2   f3    f4         f5
75  id76  71.0   경기  12.0   0  NaN  ENTJ  83.685380
76  id77  77.0   경기  31.0   0  NaN  INFP  98.429899
27  id28  38.0   부산  34.0   1  NaN  ENTP  80.138280
8   id09   3.3   서울  35.0   2  NaN  ESFJ  17.252986
94  id95  77.0   경기  43.0   1  NaN  INTJ  91.297791
83  id84  66.0   경기  44.0   0  NaN  INTP  83.685380
23  id24  80.0   부산  44.0   0  NaN  INFJ  73.586397
67  id68  35.0   경기  45.0   2  NaN  ISFP  67.886373
28  id29 -13.5   부산  47.0   2  NaN  ENTP  67.886373
98  id99   1.0   경기  47.0   0  NaN  ESFJ  97.381034

In [ ]:
df_fill = df_basic1.fillna(88.0)

중복 데이터 발생시 뒤에 나오는 데이터를 삭제함

In [ ]:
df_fill_dropdup = df_fill.drop_duplicates('age')

In [ ]:
df_fill['f1'].median()

77.5

In [ ]:
df_fill_dropdup['f1'].median()

77.0

In [ ]:
abs(df_fill['f1'].median() - df_fill_dropdup['f1'].median())

0.5

주어진 데이터(basic2.csv)에서 새로운 컬럼(1일 이전 시차 컬럼)을 만들고, Events가 1이면서 Sales가 1000000이하인 조건에 맞는 새로운 컬럼 합을 구하시오¶

In [ ]:
df.columns

Index(['Date', 'Sales', 'PV', 'UV', 'Events', 'year', 'month', 'day',
       'dayofweek', 'weekend', 'Sales2'],
      dtype='object')

In [ ]:
df.tail(10)

,Date,Sales,PV,UV,Events,year,month,day,dayofweek,weekend,Sales2
720,2023-12-22,12386380,296204,NaN,1,2023,12,22,4,False,9909104.0
721,2023-12-23,134421,2449,742.0,0,2023,12,23,5,True,134421.0
722,2023-12-24,2491262,62425,647.0,0,2023,12,24,6,True,2491262.0
723,2023-12-25,134281,1886,326.0,0,2023,12,25,0,False,134281.0
724,2023-12-26,4933265,51258,520.0,0,2023,12,26,1,False,4933265.0
725,2023-12-27,33846609,415067,7360.0,1,2023,12,27,2,False,27077287.2
726,2023-12-28,3659566,208601,2262.0,1,2023,12,28,3,False,2927652.8
727,2023-12-29,1164008,14309,193.0,0,2023,12,29,4,False,1164008.0
728,2023-12-30,3977696,60935,NaN,0,2023,12,30,5,True,3977696.0
729,2023-12-31,3719764,60963,1507.0,0,2023,12,31,6,True,3719764.0